<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Import MacPorts in Munki</string>
	<key>Identifier</key>
	<string>com.github.ygini.munki.macports-mojave</string>
	<key>Input</key>
	<dict>
		<key>MACPORTS_REQUESTED_OS</key>
		<string>10.15-Catalina</string>
		<key>MAX_OS_VER</key>
		<string>10.15.99</string>
		<key>MIN_OS_VER</key>
		<string>10.15.0</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ygini.munki.macports-abstract</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
