<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import MacPorts in Munki</string>
    <key>Identifier</key>
    <string>com.github.ygini.munki.macports-abstract</string>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Input</key>
    <dict>
        <key>MIN_OS_VER</key>
        <string></string>
        <key>MAX_OS_VER</key>
        <string></string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>unix/macports/%MACPORTS_REQUESTED_OS%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>MacPorts</string>
            <key>unattended_install</key>
            <false/>
            <key>developer</key>
            <string>MacPorts</string>
            <key>category</key>
            <string>UNIX</string>
			<key>description</key>
			<string>The MacPorts Project is an open-source community initiative to design an easy-to-use system for compiling, installing, and upgrading either command-line, X11 or Aqua based open-source software on the Mac operating system. To that end we provide the command-line driven MacPorts software package under a BSD 3-Clause License, and through it easy access to thousands of ports that greatly simplify the task of compiling and installing open-source software on your Mac.</string>
			<key>display_name</key>
			<string>MacPorts for %MACPORTS_REQUESTED_OS%</string>
            <key>minimum_os_version</key>
            <string>%MIN_OS_VER%</string>
            <key>maximum_os_version</key>
            <string>%MAX_OS_VER%</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.hansen-m.download.MacPorts</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
