<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Molotov.tv.</string>
    <key>Identifier</key>
    <string>com.github.ygini.download.Molotov</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Molotov</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.molotov.tv/app/mac/latest?version=v1</string>
                <key>re_pattern</key>      
                <string>http://desktop-auto-upgrade\.molotov\.tv/mac/Molotov-v(?P&lt;url_version_number&gt;.*?)-mac\.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://desktop-auto-upgrade.molotov.tv/mac/Molotov-v%url_version_number%-mac.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
