<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import Molotov.tv in Munki</string>
    <key>Identifier</key>
    <string>com.github.ygini.munki.Molotov</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Molotov</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/molotov</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>Molotov</string>
            <key>category</key>
            <string>Entertainment</string>
			<key>description</key>
			<string>Une façon radicalement nouvelle de regarder la télévision. Gratuitement.</string>
			<key>display_name</key>
			<string>Molotov.tv</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.ygini.download.Molotov</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
            </dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>DmgCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
