<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for Molotov.tv.</string>
    <key>Identifier</key>
    <string>com.github.ygini.download.Molotov</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Molotov</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.molotov.tv/app/mac/latest?version=v1</string>
                <key>re_pattern</key>      
                <string>https://desktop-auto-upgrade\.molotov\.tv/mac/Molotov-(?P&lt;url_version_number&gt;.*?)-mac\.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://desktop-auto-upgrade.molotov.tv/mac/Molotov-%url_version_number%-mac.zip</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Molotov.app</string>
                <key>requirement</key>
                <string>identifier "tv.molotov.MolotovDesktopApp" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S7HY56XG6J</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
