<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Auto git add, commit and push after autopkg run.</string>
    <key>Identifier</key>
    <string>GitCommitAndPush.munki</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitCommitAndPush</string>
        </dict>
    </array>
</dict>
</plist>
