<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of TripMode 2 form tripmode.ch and import it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.ygini.munki.TripMode2</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>TripMode2</string>
		<key>MUNKI_CATALOG</key>
		<string>testing</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>%MUNKI_CATALOG%</string>
			</array>
			<key>description</key>
			<string> </string>
			<key>developer</key>
			<string>TripMode</string>
			<key>display_name</key>
			<string>TripMode 2</string>
			<key>maximum_os_version</key>
			<string>10.15.99</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.ygini.download.TripMode2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
