<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Add to munki RV64 by Tweak Software. Using this recipe imply the acceptation of the Autodesk Software License And Services Agreement http://www.tweaksoftware.com/downloads/tweak-software-license-agreement-standard-terms</string>
    <key>Identifier</key>
    <string>com.github.ygini.munki.RV64</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>rv64</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>videoediting</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>Tweak Software</string>
            <key>category</key>
            <string>Video Editing</string>
			<key>description</key>
			<string>RV is the next generation image and sequence viewer for VFX and animation artists. RV is high-performance, hardware accelerated, and pipeline-friendly. It adapts to  your workflow, runs on Windows, Mac and Linux, and integrates with key tools like Nuke, Maya, Deadline, and Qube!</string>
			<key>display_name</key>
			<string>RV 64</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.ygini.download.RV64</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
