<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for NoMachine.</string>
    <key>Identifier</key>
    <string>com.github.ygini.download.NoMachine</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NoMachine</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Consider switching to the NoMachine recipes in the novaksam-recipes repo. This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.nomachine.com/download/download&amp;id=7</string>
                <key>re_pattern</key>      
                <string>https://download\.nomachine\.com/download/(?P&lt;url_major_version_number&gt;.*?)/MacOSX/nomachine_(?P&lt;url_version_number&gt;.*?)\.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.nomachine.com/download/%url_major_version_number%/MacOSX/nomachine_%url_version_number%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
