<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import NoMachine in Munki</string>
    <key>Identifier</key>
    <string>com.github.ygini.munki.NoMachine</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>nomachine</string>
        <key>DISPLAY_NAME</key>
        <string>NoMachine</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/nomachine</string>
		<key>MUNKI_CATEGORY</key>
		<string>Remote Access</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>NoMachine</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Go from your desktop to any NoMachine-enabled computer at the speed of light. Thanks to our NX technology, NoMachine is the fastest and highest quality remote desktop you have ever tried. Get to any computer in the world in just a few clicks! Take what's important where you go and share with who you want! NoMachine is your own personal server, private and secure. Did we say NoMachine is free? No strings attached.</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.novaksam.download.NoMachine</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
