<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for MestReNova.</string>
    <key>Identifier</key>
    <string>com.github.ygini.download.MestReNova</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MestReNova</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://mestrelab.com/software/mnova/download/</string>
                <key>re_pattern</key>
                <string>(?P&lt;url_subpath&gt;/software/mnova/download/thank-you?url=%2Fdownloads%2Fmnova%2Fmac%2F.*?.dmg)</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://mestrelab.com/downloads/mnova/mac/%url_subpath%.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
