<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of SketchUpMake and imports into Munki with the language code included in the item name (so you can import multiple language in the same repo, you just have to run this recipe with different settings).</string>
    <key>Identifier</key>
    <string>com.github.ygini.munki.SketchUpMake</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SketchUpMake</string>
        <key>LANG</key>
        <string>fr</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/SketchUpMake</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>SketchUp is 3D modeling software that's easy to learn and incredibly fun to use.</string>
            <key>display_name</key>
            <string>%NAME% %LANG%</string>
            <key>name</key>
            <string>%NAME%-%LANG%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.ygini.pkg.SketchUpMake</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
