<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of SketchUpMEN</string>
    <key>Identifier</key>
    <string>com.github.ygini.download.SketchUpMake</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>SketchUpMake</string>
        <key>LANG</key>
        <string>fr</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
    	<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.sketchup.com/download/all</string>
				<key>result_output_var_name</key>
				<string>url</string>
				<key>re_pattern</key>
				<string>&quot;((?:https?:)?//.+/SketchUpMake.*%LANG%.*.dmg)&quot;</string>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>SketchUpMake.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
