<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import Elasticsearch in Munki</string>
    <key>Identifier</key>
    <string>com.github.ygini.munki.elasticsearch</string>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Input</key>
    <dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>dev/elasticsearch</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <false/>
            <key>developer</key>
            <string>Elasticsearch BV</string>
            <key>category</key>
            <string>Database</string>
			<key>description</key>
			<string>Elasticsearch is a distributed, RESTful search and analytics engine capable of solving a growing number of use cases. As the heart of the Elastic Stack, it centrally stores your data so you can discover the expected and uncover the unexpected.</string>
			<key>display_name</key>
			<string>Elasticsearch</string>
            <key>requires</key>
            <array>
                <string>OracleJava8JDK</string>
            </array>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.ygini.pkg.Elasticsearch</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pkg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
