<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Elasticsearch and makes a pkg of it</string>
    <key>Identifier</key>
    <string>com.github.ygini.pkg.Elasticsearch</string>
    <key>Input</key>
    <dict>
        <key>PKG_ID</key>
        <string>com.github.ygini.pkg.Elasticsearch</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>ParentRecipe</key>
    <string>com.github.ygini.download.Elasticsearch</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>0755</string>
                    <key>Library/LaunchDaemons</key>
                    <string>0755</string>
                    <key>Library/Elasticsearch</key>
                    <string>0775</string>
                    <key>Library/Elasticsearch/Data</key>
                    <string>0775</string>
                    <key>Library/Elasticsearch/Config</key>
                    <string>0775</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Symlinker</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>./elasticsearch-%version%</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/elasticsearch.new</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_DIR%/com.github.ygini.Elasticsearch.plist</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/LaunchDaemons/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgdir</key>
                    <string>%pkgroot%</string>
                    <key>id</key>
                    <string>%PKG_ID%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>scripts</key>
                    <string>pkg-scripts</string>
                    <key>chown</key>
    				<array>
    					<dict>
    						<key>path</key>
                    		<string>/Library/LaunchDaemons</string>
    						<key>user</key>
                    		<string>root</string>
    						<key>group</key>
                    		<string>wheel</string>
    					</dict>
    					<dict>
    						<key>path</key>
                    		<string>/usr</string>
    						<key>user</key>
                    		<string>root</string>
    						<key>group</key>
                    		<string>wheel</string>
    					</dict>
    					<dict>
    						<key>path</key>
                    		<string>/usr/local/elasticsearch-%version%</string>
    						<key>user</key>
                    		<string>_www</string>
    						<key>group</key>
                    		<string>_www</string>
    					</dict>
    					<dict>
    						<key>path</key>
                    		<string>/Library/Elasticsearch</string>
    						<key>user</key>
                    		<string>root</string>
    						<key>group</key>
                    		<string>wheel</string>
    						<key>mode</key>
                    		<string>0755</string>
    					</dict>
    					<dict>
    						<key>path</key>
                    		<string>/Library/Elasticsearch/Data</string>
    						<key>user</key>
                    		<string>_www</string>
    						<key>group</key>
                    		<string>admin</string>
    						<key>mode</key>
                    		<string>0775</string>
    					</dict>
    					<dict>
    						<key>path</key>
                    		<string>/Library/Elasticsearch/Config</string>
    						<key>user</key>
                    		<string>_www</string>
    						<key>group</key>
                    		<string>admin</string>
    						<key>mode</key>
                    		<string>0775</string>
    					</dict>
				    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
