<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for eTextbooks by Houghton Mifflin Harcourt</string>
    <key>Identifier</key>
    <string>com.github.ygini.download.HMHeTextbooks</string>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Input</key>
    <dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://dc.hmhco.com/hmhstorefront/_ui/hmh/stdhelppdf/HMH%20eTextbooks.pkg</string>
                <key>filename</key>
                <string>hmh_etextbook.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
		<dict>   
			<key>Processor</key>   
			<string>CodeSignatureVerifier</string>   
			<key>Arguments</key>   
			<dict>   
				<key>input_path</key>   
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Houghton Mifflin Harcourt</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
