<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import eTextbooks by Houghton Mifflin Harcourt into munki</string>
    <key>Identifier</key>
    <string>com.github.ygini.munki.HMHeTextbooks</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>hmh_etextbooks</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/mhm/etextbooks</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>eTextbooks</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>Houghton Mifflin Harcourt</string>
            <key>category</key>
            <string>School</string>
			<key>description</key>
			<string>Houghton Mifflin Harcourt eTextbooks are digital replicas of our award winning textbooks. Now students and educators can access the same great content they've come to expect from Houghton Mifflin Harcourt on select devices - for learning and studying anywhere, anytime. 
 
The HMH eTextbooks app allows you to read Houghton Mifflin Harcourt eTextbooks on select devices, and even organizes all your titles in one convenient place. Download your free HMH eTextbooks app and start building your mobile library today!</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.ygini.download.HMHeTextbooks</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
