<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest X-Lite disk image and imports into munki.</string>
	<key>Identifier</key>
	<string>com.github.ygini.munki.X-Lite</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>X-Lite</string>
	        <key>MUNKI_REPO_SUBDIR</key>
	        <string>collab/%NAME%</string>
		<key>pkginfo</key>
		<dict>
	        	<key>catalogs</key>
        	    	<array>
                		<string>testing</string>
	            	</array>
		        <key>name</key>
     			<string>%NAME%</string>
		        <key>unattended_install</key>
		        <true/>
	            	<key>developer</key>
            		<string>CounterPath</string>
            		<key>category</key>
            		<string>Collaboration</string>
			<key>description</key>
			<string>Combining voice and video calls in a user-friendly interface, CounterPath's X-Lite helps you seamlessly transition from a traditional phone environment into the world of Voice over IP.</string>
			<key>display_name</key>
			<string>X-Lite</string>

		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.ygini.download.X-Lite</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
