<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download Sconnect by Gemalto</string>
    <key>Identifier</key>
    <string>com.github.ygini.download.Sconnect</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Sconnect</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.sconnect.com/extensions/</string>
                <key>re_pattern</key>
                <string>(?P&lt;url_subpath&gt;/CSC/download/mac/.*?/LifeSize.*?.pkg)</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://%LIFE_SIZE_SERVER%%url_subpath%</string>
                <key>filename</key>
                <string>%NAME%.pkg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
