<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import SmartGit in Munki</string>
    <key>Identifier</key>
    <string>com.github.ygini.munki.SmartGit</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>smartgit</string>
        <key>DISPLAY_NAME</key>
        <string>SmartGit</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/smartgit</string>
		<key>MUNKI_CATEGORY</key>
		<string>Developer Tools</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>Syntevo</string>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>SmartGit is a graphical Git client with Subversion support. SmartGit is free for non-commercial use and runs on macOS, Windows and Linux.</string>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.ygini.download.SmartGit</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
