<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Mattermost disk image and imports into munki.</string>
	<key>Identifier</key>
	<string>com.github.ygini.munki.Mattermost</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mattermost</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>collab/%NAME%</string>
		<key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Mattermost: Open Source, Private Cloud Slack Alternative</string>
            <key>display_name</key>
            <string>Mattermost Private Cloud Messaging</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>supported_architectures</key>
            <array>
                <string>x86_64</string>
            </array>
        </dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.Mattermost</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
	</array>
</dict>
</plist>
