<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download recipe for FileMaker 15 Updater.</string>
    <key>Identifier</key>
    <string>com.github.ygini.download.FileMaker15Updater</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileMaker15Updater</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>FileMaker 15 is no longer supported (details: https://support.claris.com/s/article/FileMaker-Announces-end-of-support-for-FileMaker-15-Platform). This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.filemaker.com/support/updaters/updater_json.txt</string>
                <key>re_pattern</key>      
                <string>http://fmdl\.filemaker\.com/UPDT/15/fm_updater_(?P&lt;url_version_number&gt;.*?)\.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://fmdl.filemaker.com/UPDT/15/fm_updater_%url_version_number%.dmg</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
