<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Import FileMaker 15 Updater in Munki</string>
    <key>Identifier</key>
    <string>com.github.ygini.munki.FileMaker15Updater</string>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FileMaker15Updater</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/FileMaker15</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>developer</key>
            <string>FileMaker</string>
            <key>category</key>
            <string>Database</string>
			<key>description</key>
			<string>The FileMaker Platform is ideally suited for your unique needs. Quickly create and run solutions that work seamlessly across iPad, iPhone, Windows, Mac and the web.</string>
			<key>display_name</key>
			<string>FileMaker 15 Update</string>
            <key>update_for</key>
            <array>
                <string>FileMaker15</string>
            </array>
        </dict>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.ygini.download.FileMaker15Updater</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
