<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and import into munki the latest version of PIA (CNIL).</string>
	<key>Identifier</key>
	<string>com.github.ygini.munki.CNIL-PIA</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/CNIL/%NAME%</string>
		<key>NAME</key>
		<string>PIA</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>Le logiciel open source PIA facilite la conduite et la formalisation d’analyses d’impact sur la protection des données telles que prévues par le RGPD. Il est édité par le laboratoire d'innovation numérique de la CNIL.</string>
			<key>developer</key>
			<string>CNIL</string>
			<key>display_name</key>
			<string>PIA</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.ygini.download.CNIL-PIA</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
